Revit 2027 API
Categories.ReverseIterator Method
Retrieves a backward moving iterator to the map.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public override CategoryNameMapIterator ReverseIterator()
Public Overrides Function ReverseIterator As CategoryNameMapIterator
public:
virtual CategoryNameMapIterator^ ReverseIterator() override
abstract ReverseIterator : unit -> CategoryNameMapIterator
override ReverseIterator : unit -> CategoryNameMapIterator
Return Value
CategoryNameMapIterator
A backward moving iterator to the map.
See Also
Reference
Categories Class
Autodesk.Revit.DB Namespace